realistic-s1/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     rhoPimpleFoam;

startFrom       latestTime;

stopAt          endTime;

endTime         207e-04;

deltaT          1e-07;

writeControl    timeStep;

writeInterval   207000;

purgeWrite      0;

writeFormat     ascii;

writePrecision  11;

writeCompression on;

timeFormat      general;

timePrecision   8;

runTimeModifiable true;

adjustTimeStep  no;

maxCo           0.9;

functions
{
    func
    {
      type writeRegisteredObject;
      functionObjectLibs ("libIOFunctionObjects.so");
      objectNames (rho p U);
      outputControl  timeStep;
      outputInterval 100;
    }
}

// ************************************************************************* //
